       IDENTIFICATION DIVISION.
           PROGRAM-ID. MAIN.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 WRK-TITLE.
               05 WRK-APP      PIC X(20) VALUE ' PERSONAL FINANCE - '.
               05 WRK-MODULE   PIC X(60).
           01 WRK-COMMAND      PIC X(01).
       SCREEN SECTION.
           01 SCR-MAIN.
               05 BLANK SCREEN.
               05 SCR-HEADER.
                   10 LINE 01 COLUMN 01 PIC X(80) FROM WRK-TITLE
                           BACKGROUND-COLOR 3.
               05 SCR-MESSAGE.
                   10 LINE 23 COLUMN 01 ERASE EOL BACKGROUND-COLOR 1.
                   10 LINE 24 COLUMN 01 ERASE EOL BACKGROUND-COLOR 1.
           01 SCR-MENU.
               05 LINE 10 COLUMN 10 VALUE '(A)CCOUNTS'.
               05 LINE 11 COLUMN 10 VALUE '(R)EPORTS'.
               05 LINE 12 COLUMN 10 VALUE '(E)XIT'.
               05 LINE 14 COLUMN 10 VALUE 'TYPE AN OPTION:'.
               05 COLUMN PLUS 01    USING WRK-COMMAND.
       PROCEDURE DIVISION.
       0000-MAIN SECTION.
           PERFORM 1000-START.
           PERFORM 2000-PROCCESS.
           PERFORM 9000-END.
           STOP RUN.
       1000-START SECTION.
           MOVE 'START' TO WRK-MODULE.
           DISPLAY SCR-MAIN.
           ACCEPT SCR-MENU.
       2000-PROCCESS SECTION.
           CONTINUE.
       9000-END SECTION.
           CONTINUE.
